//Задача 1. Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от 1 до N.

    //N = 5 -> "1, 2, 3, 4, 5"
    //N = 6 -> "1, 2, 3, 4, 5, 6"






//--------------------------------------------------------------------------------------------

//Задание 2. Напишите программу, которая будет принимать на вход число и возвращать сумму его цифр.

//453 -> 12
//45 -> 9


//-------------------------------------------------------------------------------------

//Задача 3. Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N.

//M = 1; N = 5. -> "1, 2, 3, 4, 5"
//M = 4; N = 8. -> "4, 5, 6, 7, 8"


// void ShowNums(int n, int m)
// {
//     if (m != n)
//     {
//         if (m > n)
//         {
//             ShowNums(m - 1, n);
//             System.Console.Write(m + " ");
//         }
//         else
//         {
//             ShowNums(m, n - 1);
//             System.Console.Write(n + " ");
//         }
//     }
//     else System.Console.Write(n + " ");
// }

// ShowNums(5, 10);

//---------------------------------------------------------------------------------------

//Задача 4.Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B с помощью рекурсии.

//A = 3; B = 5 -> 243 (3⁵)
//A = 2; B = 3 -> 8


// int Exponentiation(int a, int b)
// {
//     if (b >= 1)
//     {
//         return Exponentiation(a, b - 1) * a;
//     }
//     else return 1;
// }

// Console.Write(Exponentiation(3,5));